{
"comments":[
"NOT USED, only for documentation",
"Tue 28 Jul 2020 11:28:30 AM CDT",
"",
"ALL of this metadata is specific to the",
"photo album YOU ARE MAKING. YOU MUST fill in where appropriate",
"YOUR metadata, which",
"consists of ",
"of key-value pairs. The key is embedded in",
"the generic boilerplate, and must be pretty",
"unique. I use PROJECT_thingie as the pattern.",
"Value is the replacement. Example PROJECT_AUTHOR",
"has the value 'Bob Swanson'",
"",
"WARNING: must be key/value pairs, so must be an EVEN",
"   number of strings",
"",
"WARNING: content value items CANNOT contain single quotes",
"   because we are using those for the HTML tag contents",
"",
"WARNING: when designing keywords, do not let any keyword be a substring of",
" another, because the simple lookup search will see",
" the substring FIRST and substitute it!",
"",
"Example: PROJECT_ISBN and PROJECT_ISBN_SIMPLE will find the",
" first item before the second",
"",
"NOR should any keyword be the same as an actual boilerplate",
" item. For instance, some schemas want ISBN as a field",
" which could conflict with a keyword of the same name. Sooo",
" use PROJECT_ as the start of keywords, please",
"",
"when there are multiple values in the value field",
"they are separated with colons for later stripping",
"",
"",
"NOTES FOLLOW for certain keywords, rest hopefully make sense",
"",
"PROJECT_NAME: is used to construct the image input filename ",
"  example given 'cactus' as the name: cactus_images.txt",
"  also used for final output filename",
"  example: cactus_output.html",
"PROJECT_COPYRIGHT: is a string that is put into two places:",
"   (1) copyright in metadata",
"   (2) copyright statement for photos in text body",
"PROJECT_COVER_URL and PROJECT_LINKBACK: both MUST be",
"   full URL's to the primary album page and cover (head)",
"   image",
"PROJECT_COVER_NARRATIVE is used as 'alt' code for cover (head)",
"   image",
"PROJECT_TEXT  is the body text, which can be multi-paragraph",
"   paragraphs MUST be delimited by colons, and CANNOT",
"   contain colons. However, any other text can be present",
"   including HTML",
"PROJECT_TITLE appears in meta data and as main <h2> heading",
"PROJECT_KEYWORDS must be formatted for metadata, so commas",
"    MUST delimit",
"not used",
"PROJECT_COVER_URL","aprevious.jpg",
""

],

"project":[
"PROJECT_NAME","EXAMPLE",
"PROJECT_AUTHOR","YOU",
"PROJECT_COPYRIGHT","YOU, 2020",
"PROJECT_COVER_URL","http://cdn.ipernity.com/200/20/32/49722032.e795e4b0.640.jpg' width='500",
"PROJECT_COVER_NARRATIVE","YOUR COVER image",
"PROJECT_LINKBACK_URL","http://yourwebsite.com/index.html", 
"PROJECT_LINKBACK_TEXT","YOUR website main page",
"PROJECT_TEXT","This is example text that appears at the top of the HTML page.:Note that new paragraphs can be made by specifying a single colon.:NOTE, that the text you are entering CANNOT contain a colon. If you need to add one, use the HTML notation for colon &amp;#x3a; (makes... &#x3a; ).:For instance to indicate a link to a webpage, use <a href='http&#x3a;//google.com'>Google</a>.:ALSO, since this text is inside of double quotes, either you have to use single quotes, as the previous link shows, or escape the double quotes with the backslash. Thems the rules for JSON.",
"PROJECT_DESCRIPTION","This web page contains  EXAMPLE photos made into a static HTML web page",

"PROJECT_TITLE","EXAMPLE",

"PROJECT_DATE","internal",

"PROJECT_KEYWORDS","photo, example"

 ]

}

